# Share of education in government expenditure

## Plan of Action

- Explore the data 
- Add in any missing values from other data sources
- Clean the data
- Get the mean rate of education in government expenditure over a given time period (2000-2021)

## Data source

- The raw data source is avaliable in a csv file titled 'share-of-education-in-government-expenditure.csv'
- This data source (https://ourworldindata.org/grapher/share-of-education-in-government-expenditure) was derived from the World Bank government spending across the world
- The original datasets spans a time period from 1980 to 2021
- The world bank describes the data as "General government expenditure on education (current, capital, and transfers) is expressed as a percentage of total general government expenditure on all sectors (including health, education, social services, etc.)" https://ourworldindata.org/government-spending
- They also add "General government usually refers to local, regional and central governments."

In [2]:
import pandas as pd

In [3]:
df2 = pd.read_csv("share-of-education-in-government-expenditure.csv")
df2

,Entity,Code,Year,"Government expenditure on education, total (% of government expenditure)"
0,Afghanistan,AFG,2010,17.067560
1,Afghanistan,AFG,2011,16.048429
2,Afghanistan,AFG,2013,14.102800
3,Afghanistan,AFG,2014,14.465930
4,Afghanistan,AFG,2015,12.509000
...,...,...,...,...
3529,Zimbabwe,ZWE,2014,30.015150
3530,Zimbabwe,ZWE,2015,29.470831
3531,Zimbabwe,ZWE,2016,23.527081
3532,Zimbabwe,ZWE,2017,20.874201
3533,Zimbabwe,ZWE,2018,19.039841

## Let's see what this data looks like

In [4]:
df2.shape

(3534, 4)

This dataframe has 3534 rows and 4 columns

In [5]:
df2['Year'].min()

1980

The earliest year in this dataset is 1980

In [6]:
df2.dtypes

Entity                                                                       object
Code                                                                         object
Year                                                                          int64
Government expenditure on education, total (% of government expenditure)    float64
dtype: object

In [7]:
df2.columns

Index(['Entity', 'Code', 'Year',
       'Government expenditure on education, total (% of government expenditure)'],
      dtype='object')

In [8]:
df2['Entity'].nunique()

206

## Renaming columns 
- All other names are rather simple, except for the government expenditure one, which may cause unnecessary problems when dealing with this column. So let's rename this column 
- The 'Entity' columnn refers to  countries, so let's rename this column as well

In [9]:
df2.rename(columns={'Government expenditure on education, total (% of government expenditure)': 'Gvt_Exp_on_Education'}, inplace=True)
df2.rename(columns = {'Entity': 'Country'}, inplace=True)

Let's check the column names now

In [10]:
df2.columns

Index(['Country', 'Code', 'Year', 'Gvt_Exp_on_Education'], dtype='object')

Let's create a copy of the filtered table in case we want to go back to the original

In [11]:
filtered_df = df2.copy()

Since we have already identified the countries with the 5 highest and lowest highest literacy rates, we can filter those countries

In [12]:
countries = ['Korea', 'Latvia', 'Estonia', 'Lithuania', 'Cuba', 'Chad', 'Afghanistan', 'Mali', 'Niger', 'Guinea']
filtered_df = df2[df2["Country"].isin(countries)]
filtered_df = filtered_df.reset_index(drop=True)
filtered_df

         Country Code  Year  Gvt_Exp_on_Education
0    Afghanistan  AFG  2010             17.067560
1    Afghanistan  AFG  2011             16.048429
2    Afghanistan  AFG  2013             14.102800
3    Afghanistan  AFG  2014             14.465930
4    Afghanistan  AFG  2015             12.509000
..           ...  ...   ...                   ...
157        Niger  NER  2017             13.215160
158        Niger  NER  2018             16.339970
159        Niger  NER  2019             13.012810
160        Niger  NER  2020             13.332540
161        Niger  NER  2021             11.952620

[162 rows x 4 columns]

Let's check to see if our data has all of the countries that we are looking for

In [13]:
filtered_df['Country'].nunique()

8

In [14]:
unique_countries = filtered_df['Country'].unique()
print("Unique countries:", unique_countries)

Unique countries: ['Afghanistan' 'Chad' 'Estonia' 'Guinea' 'Latvia' 'Lithuania' 'Mali'
 'Niger']

We can see that Cuba and Korea are missing from the dataset, so we'll have to add those in

### Additional dataset

We found another dataset (https://data.worldbank.org/indicator/SE.XPD.TOTL.GD.ZS?end=2020&start=1980&view=chart) which had some more values from different region and countries.

Let's check this dataset to see if we can find some data for Cuba and Korea

In [15]:
df3 = pd.read_csv("education-gvt-exp-incl-cuba.csv")
df3

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
0,Aruba,ABW,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,21.877630,19.617979,23.201380,21.853750,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,17.243259,18.097099,16.962910,17.198811,17.150761,17.306705,15.35272,14.564090,13.65829,NaN
2,Afghanistan,AFG,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,14.102800,14.465930,12.509000,13.091000,12.033200,11.696060,11.34377,10.253860,10.88011,NaN
3,Africa Western and Central,AFW,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,14.963605,12.939880,13.121995,12.854880,16.058439,16.114195,14.15939,14.339985,14.93463,13.813610
4,Angola,AGO,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,8.826970,6.162840,8.918780,6.550970,6.763780,5.410230,6.04536,6.467230,6.91961,6.640472
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
261,Kosovo,XKX,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
262,"Yemen, Rep.",YEM,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
263,South Africa,ZAF,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,18.696600,18.989161,18.699350,18.048740,18.719290,18.901590,19.59623,19.527281,18.41724,19.750040
264,Zambia,ZMB,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,15.400000,20.100000,16.335600,15.663620,14.934340,17.118719,15.29187,12.378020,11.51414,10.447814
265,Zimbabwe,ZWE,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,28.660339,30.015150,29.470831,23.527081,20.874201,19.039841,NaN,15.666611,NaN,NaN

Let's explore this dataset

In [16]:
df3.columns

Index(['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code',
       '1960', '1961', '1962', '1963', '1964', '1965', '1966', '1967', '1968',
       '1969', '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977',
       '1978', '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986',
       '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994', '1995',
       '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004',
       '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013',
       '2014', '2015', '2016', '2017', '2018', '2019', '2020', '2021', '2022'],
      dtype='object')

In [17]:
df3['Country Name'].unique()

array(['Aruba', 'Africa Eastern and Southern', 'Afghanistan',
       'Africa Western and Central', 'Angola', 'Albania', 'Andorra',
       'Arab World', 'United Arab Emirates', 'Argentina', 'Armenia',
       'American Samoa', 'Antigua and Barbuda', 'Australia', 'Austria',
       'Azerbaijan', 'Burundi', 'Belgium', 'Benin', 'Burkina Faso',
       'Bangladesh', 'Bulgaria', 'Bahrain', 'Bahamas, The',
       'Bosnia and Herzegovina', 'Belarus', 'Belize', 'Bermuda',
       'Bolivia', 'Brazil', 'Barbados', 'Brunei Darussalam', 'Bhutan',
       'Botswana', 'Central African Republic', 'Canada',
       'Central Europe and the Baltics', 'Switzerland', 'Channel Islands',
       'Chile', 'China', "Cote d'Ivoire", 'Cameroon', 'Congo, Dem. Rep.',
       'Congo, Rep.', 'Colombia', 'Comoros', 'Cabo Verde', 'Costa Rica',
       'Caribbean small states', 'Cuba', 'Curacao', 'Cayman Islands',
       'Cyprus', 'Czechia', 'Germany', 'Djibouti', 'Dominica', 'Denmark',
       'Dominican Republic', 'Algeria',
       'East Asia & Pacific (excluding high income)',
       'Early-demographic dividend', 'East Asia & Pacific',
       'Europe & Central Asia (excluding high income)',
       'Europe & Central Asia', 'Ecuador', 'Egypt, Arab Rep.',
       'Euro area', 'Eritrea', 'Spain', 'Estonia', 'Ethiopia',
       'European Union', 'Fragile and conflict affected situations',
       'Finland', 'Fiji', 'France', 'Faroe Islands',
       'Micronesia, Fed. Sts.', 'Gabon', 'United Kingdom', 'Georgia',
       'Ghana', 'Gibraltar', 'Guinea', 'Gambia, The', 'Guinea-Bissau',
       'Equatorial Guinea', 'Greece', 'Grenada', 'Greenland', 'Guatemala',
       'Guam', 'Guyana', 'High income', 'Hong Kong SAR, China',
       'Honduras', 'Heavily indebted poor countries (HIPC)', 'Croatia',
       'Haiti', 'Hungary', 'IBRD only', 'IDA & IBRD total', 'IDA total',
       'IDA blend', 'Indonesia', 'IDA only', 'Isle of Man', 'India',
       'Not classified', 'Ireland', 'Iran, Islamic Rep.', 'Iraq',
       'Iceland', 'Israel', 'Italy', 'Jamaica', 'Jordan', 'Japan',
       'Kazakhstan', 'Kenya', 'Kyrgyz Republic', 'Cambodia', 'Kiribati',
       'St. Kitts and Nevis', 'Korea, Rep.', 'Kuwait',
       'Latin America & Caribbean (excluding high income)', 'Lao PDR',
       'Lebanon', 'Liberia', 'Libya', 'St. Lucia',
       'Latin America & Caribbean',
       'Least developed countries: UN classification', 'Low income',
       'Liechtenstein', 'Sri Lanka', 'Lower middle income',
       'Low & middle income', 'Lesotho', 'Late-demographic dividend',
       'Lithuania', 'Luxembourg', 'Latvia', 'Macao SAR, China',
       'St. Martin (French part)', 'Morocco', 'Monaco', 'Moldova',
       'Madagascar', 'Maldives', 'Middle East & North Africa', 'Mexico',
       'Marshall Islands', 'Middle income', 'North Macedonia', 'Mali',
       'Malta', 'Myanmar',
       'Middle East & North Africa (excluding high income)', 'Montenegro',
       'Mongolia', 'Northern Mariana Islands', 'Mozambique', 'Mauritania',
       'Mauritius', 'Malawi', 'Malaysia', 'North America', 'Namibia',
       'New Caledonia', 'Niger', 'Nigeria', 'Nicaragua', 'Netherlands',
       'Norway', 'Nepal', 'Nauru', 'New Zealand', 'OECD members', 'Oman',
       'Other small states', 'Pakistan', 'Panama', 'Peru', 'Philippines',
       'Palau', 'Papua New Guinea', 'Poland', 'Pre-demographic dividend',
       'Puerto Rico', "Korea, Dem. People's Rep.", 'Portugal', 'Paraguay',
       'West Bank and Gaza', 'Pacific island small states',
       'Post-demographic dividend', 'French Polynesia', 'Qatar',
       'Romania', 'Russian Federation', 'Rwanda', 'South Asia',
       'Saudi Arabia', 'Sudan', 'Senegal', 'Singapore', 'Solomon Islands',
       'Sierra Leone', 'El Salvador', 'San Marino', 'Somalia', 'Serbia',
       'Sub-Saharan Africa (excluding high income)', 'South Sudan',
       'Sub-Saharan Africa', 'Small states', 'Sao Tome and Principe',
       'Suriname', 'Slovak Republic', 'Slovenia', 'Sweden', 'Eswatini',
       'Sint Maarten (Dutch part)', 'Seychelles', 'Syrian Arab Republic',
       'Turks and Caicos Islands', 'Chad',
       'East Asia & Pacific (IDA & IBRD countries)',
       'Europe & Central Asia (IDA & IBRD countries)', 'Togo', 'Thailand',
       'Tajikistan', 'Turkmenistan',
       'Latin America & the Caribbean (IDA & IBRD countries)',
       'Timor-Leste', 'Middle East & North Africa (IDA & IBRD countries)',
       'Tonga', 'South Asia (IDA & IBRD)',
       'Sub-Saharan Africa (IDA & IBRD countries)', 'Trinidad and Tobago',
       'Tunisia', 'Turkiye', 'Tuvalu', 'Tanzania', 'Uganda', 'Ukraine',
       'Upper middle income', 'Uruguay', 'United States', 'Uzbekistan',
       'St. Vincent and the Grenadines', 'Venezuela, RB',
       'British Virgin Islands', 'Virgin Islands (U.S.)', 'Vietnam',
       'Vanuatu', 'World', 'Samoa', 'Kosovo', 'Yemen, Rep.',
       'South Africa', 'Zambia', 'Zimbabwe'], dtype=object)

This dataset also has regional figures for government expenditure on education alongside its country data. This will be useful if we can not find any figures for our top 5 and our bottom 5

### Let's see if we can find data for Cuba and Korea

In [18]:
korea_data = df3[df3['Country Name'].str.contains('Korea')]
korea_data

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
126,"Korea, Rep.",KOR,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,14.65296,14.30254,14.29845,14.31293,13.83082,NaN,NaN,NaN
193,"Korea, Dem. People's Rep.",PRK,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

We are interested in Korea, Dem. People's Rep. and there is no data for Korea in this dataset so we will use the regional figures in its place

In [19]:
df3[df3['Country Name'].str.contains('East Asia')]

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
61,East Asia & Pacific (excluding high income),EAP,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,16.301397,16.045906,15.317964,15.115435,14.256830,16.325880,15.521901,14.407170,15.276836,NaN
63,East Asia & Pacific,EAS,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,16.422539,16.155823,15.317964,15.115435,14.695935,16.086915,13.930195,14.418585,14.754606,NaN
230,East Asia & Pacific (IDA & IBRD countries),TEA,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,16.301397,16.045906,15.317964,15.115435,14.256830,16.325880,15.521901,14.407170,15.276836,NaN

We will go for the 'East Asia & Pacific' since we don't want to exclude high income

In [20]:
korean_data = df3[df3['Country Name'] == 'East Asia & Pacific']
korean_data

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
63,East Asia & Pacific,EAS,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,16.422539,16.155823,15.317964,15.115435,14.695935,16.086915,13.930195,14.418585,14.754606,NaN

Let's check for our Cuban data

In [21]:
cuba_data = df3[df3['Country Name'] == 'Cuba']
cuba_data

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
50,Cuba,CUB,"Government expenditure on education, total (% ...",SE.XPD.TOTL.GB.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,16.519653,15.801738,15.263568,14.937566,13.564914,12.659974,14.225944,16.6611,NaN,NaN

Let's make a data frame with both our Cuba and East Asian figures # delete this

## Let's add both our Cuban and Korean figueres to our filtered_df dataframe

In [22]:
cuba_data = cuba_data.copy()

In [23]:
cuba_data.columns

Index(['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code',
       '1960', '1961', '1962', '1963', '1964', '1965', '1966', '1967', '1968',
       '1969', '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977',
       '1978', '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986',
       '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994', '1995',
       '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004',
       '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013',
       '2014', '2015', '2016', '2017', '2018', '2019', '2020', '2021', '2022'],
      dtype='object')

### Cleaning the Cuban data

First we will drop the columns that do not suit our given range

In [24]:
cuba_data.drop(cuba_data.columns[cuba_data.columns < '2000'], axis=1, inplace=True)

Let's check the columns with the years before 2000 have been dropped correctly

In [25]:
cuba_data.columns

Index(['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code',
       '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008',
       '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017',
       '2018', '2019', '2020', '2021', '2022'],
      dtype='object')

We need to melt the columns to mirror the format of our filtered_df dataframe

In [26]:
# # Rename the columns
cuba_data = cuba_data.rename(columns={'Country Name': 'Country', 'Country Code': 'Code', 'Indicator Name': 'Indicator', 'Indicator Code': 'Indicator Code'})

# Perform melt
cuba_data = cuba_data.melt(id_vars=['Country', 'Code'], value_vars = ['2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017','2018', '2019', '2020', '2021', '2022'], 
                                                                      var_name='Year', value_name='Gvt_Exp_on_Education')

In [27]:
cuba_data

   Country Code  Year  Gvt_Exp_on_Education
0     Cuba  CUB  2000                   NaN
1     Cuba  CUB  2001                   NaN
2     Cuba  CUB  2002                   NaN
3     Cuba  CUB  2003                   NaN
4     Cuba  CUB  2004                   NaN
5     Cuba  CUB  2005                   NaN
6     Cuba  CUB  2006                   NaN
7     Cuba  CUB  2007                   NaN
8     Cuba  CUB  2008                   NaN
9     Cuba  CUB  2009                   NaN
10    Cuba  CUB  2010                   NaN
11    Cuba  CUB  2011                   NaN
12    Cuba  CUB  2012             16.478830
13    Cuba  CUB  2013             16.519653
14    Cuba  CUB  2014             15.801738
15    Cuba  CUB  2015             15.263568
16    Cuba  CUB  2016             14.937566
17    Cuba  CUB  2017             13.564914
18    Cuba  CUB  2018             12.659974
19    Cuba  CUB  2019             14.225944
20    Cuba  CUB  2020             16.661100
21    Cuba  CUB  2021                   NaN
22    Cuba  CUB  2022                   NaN

### Cleaning the Korea data

In [28]:
korean_data = korean_data.copy()

In [29]:
korean_data.drop(korean_data.columns[korean_data.columns < '2000'], axis=1, inplace=True)

In [30]:
korean_data.columns

Index(['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code',
       '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008',
       '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017',
       '2018', '2019', '2020', '2021', '2022'],
      dtype='object')

In [31]:
# # Rename the columns
korean_data = korean_data.rename(columns={'Country Name': 'Country', 'Country Code': 'Code', 'Indicator Name': 'Indicator', 'Indicator Code': 'Indicator Code'})

# Perform melt operation
korean_data = korean_data.melt(id_vars=['Country', 'Code'], value_vars = ['2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017','2018', '2019', '2020', '2021', '2022'], 
                                                                      var_name='Year', value_name='Gvt_Exp_on_Education')

In [32]:
korean_data

                Country Code  Year  Gvt_Exp_on_Education
0   East Asia & Pacific  EAS  2000                   NaN
1   East Asia & Pacific  EAS  2001                   NaN
2   East Asia & Pacific  EAS  2002             16.497231
3   East Asia & Pacific  EAS  2003                   NaN
4   East Asia & Pacific  EAS  2004             16.439480
5   East Asia & Pacific  EAS  2005                   NaN
6   East Asia & Pacific  EAS  2006                   NaN
7   East Asia & Pacific  EAS  2007             14.964565
8   East Asia & Pacific  EAS  2008             14.188845
9   East Asia & Pacific  EAS  2009             14.511420
10  East Asia & Pacific  EAS  2010             14.962090
11  East Asia & Pacific  EAS  2011             14.623970
12  East Asia & Pacific  EAS  2012             16.301448
13  East Asia & Pacific  EAS  2013             16.422539
14  East Asia & Pacific  EAS  2014             16.155823
15  East Asia & Pacific  EAS  2015             15.317964
16  East Asia & Pacific  EAS  2016             15.115435
17  East Asia & Pacific  EAS  2017             14.695935
18  East Asia & Pacific  EAS  2018             16.086915
19  East Asia & Pacific  EAS  2019             13.930195
20  East Asia & Pacific  EAS  2020             14.418585
21  East Asia & Pacific  EAS  2021             14.754606
22  East Asia & Pacific  EAS  2022                   NaN

Now we need to add these figures onto our filtered_df dataframe using .concat()

In [33]:
# Concatenate the two DataFrames
combined_df = pd.concat([filtered_df, cuba_data, korean_data])

# Optional: Reset the index of the combined DataFrame
combined_df = combined_df.reset_index(drop=True)

combined_df

                 Country Code  Year  Gvt_Exp_on_Education
0            Afghanistan  AFG  2010             17.067560
1            Afghanistan  AFG  2011             16.048429
2            Afghanistan  AFG  2013             14.102800
3            Afghanistan  AFG  2014             14.465930
4            Afghanistan  AFG  2015             12.509000
..                   ...  ...   ...                   ...
203  East Asia & Pacific  EAS  2018             16.086915
204  East Asia & Pacific  EAS  2019             13.930195
205  East Asia & Pacific  EAS  2020             14.418585
206  East Asia & Pacific  EAS  2021             14.754606
207  East Asia & Pacific  EAS  2022                   NaN

[208 rows x 4 columns]

In [34]:
unique_countries = combined_df['Country'].nunique()
print("Number of unique countries:", unique_countries)

Number of unique countries: 10

We now have all of our ten countries in one dataframe

### Looking at our filtered dataset

Let's change the 'East Asia & Pacific' value to 'Korea, Dem. People's Rep.'

In [35]:
combined_df['Country'] = combined_df['Country'].replace('East Asia & Pacific', "Korea, Dem. People's Rep.")

In [36]:
combined_df.dtypes

Country                  object
Code                     object
Year                     object
Gvt_Exp_on_Education    float64
dtype: object

In [37]:
combined_df['Year'] = combined_df['Year'].astype(int)

By looking at the .min() of the data we can see that the data starts from 1991

In [38]:
print("The minimum year is", combined_df['Year'].min())
print("The maximum year is",combined_df['Year'].max())

The minimum year is 1991
The maximum year is 2022

Since we are only looking at data from 2000 - 2021, we'll need to get rid of any rows from 1997 to 1999 and after 2021

In [39]:
combined_df = combined_df[combined_df['Year'] > 1999]
combined_df = combined_df.loc[combined_df['Year'] <= 2021]
combined_df = combined_df.reset_index(drop=True)

Let's check to see what year the dataset now starts from

In [40]:
print("The minimum year is", combined_df['Year'].min())
print("The maximum year is",combined_df['Year'].max())

The minimum year is 2000
The maximum year is 2021

Not all of the countries in our chosen 10 have the same year range, so we'll have to see what the time span is for each country

In [41]:
country_count = combined_df.groupby('Country')['Year'].count()
country_count

Country
Afghanistan                  11
Chad                         16
Cuba                         22
Estonia                      18
Guinea                       20
Korea, Dem. People's Rep.    22
Latvia                       18
Lithuania                    18
Mali                         20
Niger                        20
Name: Year, dtype: int64

The highest amount of years is 21 and the lowest is 11, this is not too much of a range, so we can proceed

## Cleaning the data

In [42]:
combined_df[['Country', 'Gvt_Exp_on_Education']][combined_df.Gvt_Exp_on_Education.isna()]

                       Country  Gvt_Exp_on_Education
141                       Cuba                   NaN
142                       Cuba                   NaN
143                       Cuba                   NaN
144                       Cuba                   NaN
145                       Cuba                   NaN
146                       Cuba                   NaN
147                       Cuba                   NaN
148                       Cuba                   NaN
149                       Cuba                   NaN
150                       Cuba                   NaN
151                       Cuba                   NaN
152                       Cuba                   NaN
162                       Cuba                   NaN
163  Korea, Dem. People's Rep.                   NaN
164  Korea, Dem. People's Rep.                   NaN
166  Korea, Dem. People's Rep.                   NaN
168  Korea, Dem. People's Rep.                   NaN
169  Korea, Dem. People's Rep.                   NaN

In [43]:
#removing the rows with null values
combined_df.dropna(inplace=True)

### Finding the mean of each country

In [44]:
# we are grouping our data by year and then calculate mean Gross Earnings for each year. 
countries_mean = combined_df.groupby('Country')['Gvt_Exp_on_Education'].mean()
countries_mean

Country
Afghanistan                  13.044702
Chad                         11.933025
Cuba                         15.123699
Estonia                      13.668718
Guinea                       12.861944
Korea, Dem. People's Rep.    15.258061
Latvia                       14.311544
Lithuania                    13.705299
Mali                         16.659471
Niger                        16.770930
Name: Gvt_Exp_on_Education, dtype: float64

### Finding the median for each country

In [45]:
countries_median = combined_df.groupby('Country')['Gvt_Exp_on_Education'].median()
countries_median

Country
Afghanistan                  12.509000
Chad                         12.066485
Cuba                         15.263568
Estonia                      13.524495
Guinea                       12.421840
Korea, Dem. People's Rep.    14.964565
Latvia                       14.097230
Lithuania                    13.239080
Mali                         16.519120
Niger                        16.775310
Name: Gvt_Exp_on_Education, dtype: float64

For this dataset, we have decided to go with the mean, since it is not too far off from the median, so there aren't significant outliers in this data

In [ ]:
#scatter plot for the mean values just to look at the outliers 
# visualisations
# join the cuba and korea data to the original dataframe 
# add the mean value as another column onto merged_data.csv

Let's create a scatter plot to show the mean

In [ ]:
import matplotlib.pyplot as plt

# Plot scatter plot
plt.scatter(countries_mean.index, countries_mean.values)

# Set labels and title
plt.xlabel('Country')
plt.ylabel('Mean Gvt_Exp_on_Education')
plt.title('Mean Government Expenditure on Education by Country')

# Rotate x-axis labels if needed
plt.xticks(rotation=90)

# Display the plot
plt.show()

In [ ]:
import matplotlib.pyplot as plt

# Group the data by country and year and get all values of 'Gvt_Exp_on_Education'
country_data = filtered_df.groupby('Country')['Gvt_Exp_on_Education'].mean()

# Extract the countries and corresponding values
countries = country_data.index
values = country_data.values

# Plot the data
plt.scatter(countries, values)

# Set labels and title
plt.xlabel('Country')
plt.ylabel('Gvt_Exp_on_Education')
plt.title('Government Expenditure on Education by Country')

# Rotate x-axis tick labels if needed
plt.xticks(rotation=90)

# Display the plot
plt.show()

# Add the mean value as another column onto merged_data.csv

In [53]:
## Merging our mean government expenditure results to our merged_csv table

# Read the CSV file into a DataFrame
merged_tables_df = pd.read_csv('merged_tables.csv')

merged_tables_df = merged_tables_df.drop(columns = 'Gvt_Exp_on_Education')

merged_tables_df

,Country Name,Country Code,Status,Mean Adult Female Literacy Rate (%),Median Female Child Marriage Rate (%),Income Level
0,Chad,TCD,Lowest,15.379128,24.5560,Low income
1,Afghanistan,AFG,Lowest,19.809310,16.3000,Low income
2,Mali,MLI,Lowest,20.470424,42.1000,Low income
3,Niger,NER,Lowest,20.530956,21.1555,Low income
4,Guinea,GIN,Lowest,22.271088,28.1000,Low income
5,Cuba,CUB,Highest,99.769315,12.3620,Upper middle income
6,Lithuania,LTU,Highest,99.777059,0.1500,High income
7,Estonia,EST,Highest,99.849846,4.8805,High income
8,Latvia,LVA,Highest,99.858515,4.8805,High income
9,"Korea, Dem. People's Rep.",PRK,Highest,99.997612,0.0500,Low income

In [59]:
# Merge the countries_mean with the 'merged_tables' DataFrame
merged_tables = merged_tables_df.merge(countries_mean, left_on='Country Name', right_index=True, how='left')

# Save the updated DataFrame back to the 'merged_tables.csv' CSV file
merged_tables.to_csv('merged_tables.csv', index=False)

In [62]:
merged_tables

,Country Name,Country Code,Status,Mean Adult Female Literacy Rate (%),Median Female Child Marriage Rate (%),Income Level,Gvt_Exp_on_Education
0,Chad,TCD,Lowest,15.379128,24.5560,Low income,11.933025
1,Afghanistan,AFG,Lowest,19.809310,16.3000,Low income,13.044702
2,Mali,MLI,Lowest,20.470424,42.1000,Low income,16.659471
3,Niger,NER,Lowest,20.530956,21.1555,Low income,16.770930
4,Guinea,GIN,Lowest,22.271088,28.1000,Low income,12.861944
5,Cuba,CUB,Highest,99.769315,12.3620,Upper middle income,15.123699
6,Lithuania,LTU,Highest,99.777059,0.1500,High income,13.705299
7,Estonia,EST,Highest,99.849846,4.8805,High income,13.668718
8,Latvia,LVA,Highest,99.858515,4.8805,High income,14.311544
9,"Korea, Dem. People's Rep.",PRK,Highest,99.997612,0.0500,Low income,15.258061

In [64]:
# Rename the column
merged_tables = merged_tables.rename(columns={'Gvt_Exp_on_Education': "Mean Government Education Expenditure Rate (%)"})

In [65]:
merged_tables

,Country Name,Country Code,Status,Mean Adult Female Literacy Rate (%),Median Female Child Marriage Rate (%),Income Level,Mean Government Education Expenditure Rate (%)
0,Chad,TCD,Lowest,15.379128,24.5560,Low income,11.933025
1,Afghanistan,AFG,Lowest,19.809310,16.3000,Low income,13.044702
2,Mali,MLI,Lowest,20.470424,42.1000,Low income,16.659471
3,Niger,NER,Lowest,20.530956,21.1555,Low income,16.770930
4,Guinea,GIN,Lowest,22.271088,28.1000,Low income,12.861944
5,Cuba,CUB,Highest,99.769315,12.3620,Upper middle income,15.123699
6,Lithuania,LTU,Highest,99.777059,0.1500,High income,13.705299
7,Estonia,EST,Highest,99.849846,4.8805,High income,13.668718
8,Latvia,LVA,Highest,99.858515,4.8805,High income,14.311544
9,"Korea, Dem. People's Rep.",PRK,Highest,99.997612,0.0500,Low income,15.258061

In [66]:
# Save the updated DataFrame back to the 'merged_tables.csv' CSV file
merged_tables.to_csv('merged_tables.csv', index=False)